#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    cout << "Введите a,b,c" << "\n";
    float a, b, c, d;
    cin >> a >> b >> c;
    d = b * b - 4 * a * c;
    if (d <= 0)
    {
        cout << "нет корней" << "\n";
    }
    else
    {
        cout << (-b + sqrt(d)) / (2 * a) << "\n";
        cout << (-b - sqrt(d)) / (2 * a) << "\n";
    }
}

//a,b,c,=,ответ компилятора,ожидаемый ответ
//1,5,0,0, 0 -5 , 0 -5
//2,1,67,0,Нет корней , нет корней
//5,-3,-2,0, 1 -0,4, 1 -0,4
//1,6,8,0, -2 -4 , -2 -4
//2,-4,-30,0, 5 -3, 5 -3
//16,-24,9,0, нет корней, нет корней
//6,3,15,0, нет корней, нет корней 
//1,0,144,0, нет корней, нет корней
//1,-3,-4,0, 4 -1, 4 -1
//-64,0,16,0, 0.5 -0.5, 0.5 -0.5
